IDEA StatiCa Open Model
Opening.GeomId Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Id representing geometrical parts of Detail
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public int GeomId { get; set; }
Public Property GeomId As Integer
	Get
	Set
public:
property int GeomId {
	int get ();
	void set (int value);
}
Property Value
Type: Int32
See Also
Reference
Opening Class
IdeaRS.OpenModel.Detail Namespace